xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
/*  Copyright (c) 2003-2017, LogMeIn, Inc. All rights reserved.
    This is part of Xively C library. */

#include <xively.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "../cbor/cbor.h"
#include "../cbor/cn-cbor/cn-cbor.h"
#include "../sha256/sha256.h"
#include "xi_sft.h"

/* Simpelink EXT lib includes */
#include "flc_api.h"

#if(0)
#include "rom_map.h"
#include "hw_types.h"
#include "prcm.h"
#endif
#include "hw_memmap.h"
#include "hw_common_reg.h"
#include "hw_types.h"
#include "hw_ints.h"
#include "interrupt.h"
#include "rom.h"
#include "rom_map.h"
#include "uart.h"
#include "prcm.h"
#include "utils.h"

#include "uart_if.h"
#define  UART_PRINT  Report
#undef   printf
#define  printf      Report

extern int readBootinfo();

///// Test these individually
#define MAX_INCOMING_FILENAME_LENGTH 50

int filelength = 0;
int offset = 0;
int downloading = 0;
int tenpercent = 0;
int currenttenpercent = 0;
char filename[50] = "OS?";
char installedfilerevision[50] = "0.0";
char fileRevision[50] = "0.0";
char incomingFilename[MAX_INCOMING_FILENAME_LENGTH] ="";
unsigned char filefingerprint[32];
unsigned char hash[32];
int idx;
typedef unsigned char uchar;
typedef unsigned int uint;
long lFileHandle;
unsigned long ulToken;

SHA256_CTX ctx;

char buffer[400];

#define MESSAGESIZE 50
char message[MESSAGESIZE];
#define DETAILSSIZE 400
char details[DETAILSSIZE];

unsigned char encoded[1024];
ssize_t enc_sz;
char xi_stopic[128];
char xi_logtopic[128];
char xi_ctopic[128];

void xi_parse_file_chunk(cn_cbor *cb);
void xi_parse_file_update_available(cn_cbor *cb);
void xi_publish_file_info(xi_context_handle_t in_context_handle);

void print_hash(unsigned char hash[])
{
   int idx;
   for (idx=0; idx < 32; idx++)
      printf("%02x",hash[idx]);
   printf("\n");
}

//****************************************************************************
//
//! Reboot the MCU by requesting hibernate for a short duration
//!
//! \return None
//
//****************************************************************************
static void RebootMCU()
{

  //
  // Configure hibernate RTC wakeup
  //
  PRCMHibernateWakeupSourceEnable(PRCM_HIB_SLOW_CLK_CTR);

  //
  // Delay loop
  //
  MAP_UtilsDelay(8000000);

  //
  // Set wake up time
  //
  PRCMHibernateIntervalSet(330);

  //
  // Request hibernate
  //
  PRCMHibernateEnter();

  //
  // Control should never reach here
  //
  while(1)
  {

  }
}

void on_sft_message( xi_context_handle_t in_context_handle,
                            xi_sub_call_type_t call_type,
                            const xi_sub_call_params_t* const params,
                            xi_state_t state,
                            void* user_data )
{
    cn_cbor *cb = NULL;
    char filefingerprintASCII[70];
    char *bufptr = NULL;
    int i = 0 ;
    cn_cbor* cb_item = NULL;
    const uint8_t* payload_data = NULL;
    size_t payload_length = 0;
    int retVal;

    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                printf( "topic:%s. Subscription failed.\n", params->suback.topic );
            }
            else
            {
                printf( "topic:%s. Subscription granted %d.\n", params->suback.topic,
                        ( int )params->suback.suback_status );
            }
            //printf("PUBLISHING FILE INFO\n\r");
            //xi_publish_file_info(in_context_handle);
            return;
        case XI_SUB_CALL_MESSAGE:
            //printf( "topic:%s. message received.\n", params->message.topic );

            /* get the payload parameter that contains the data that was sent. */
            payload_data = params->message.temporary_payload_data;
            payload_length = params->message.temporary_payload_data_length;

            /* Figure out what the packet type is and then call the appropriate parser */
            cb = cn_cbor_decode(payload_data, payload_length, 0);

            if (cb) {
#ifdef XI_DEBUGSFT
                dump(cb, buffer, &bufend, 0);
                *bufend = 0;
                printf("%s\n", buffer);
#endif

                cb_item = cn_cbor_mapget_string(cb, "msgtype");
                if(cb_item) {
                    //printf("msgtype = %d\n",cb_item->v.uint);
                    switch(cb_item->v.uint) {
                        case XI_FILE_UPDATE_AVAILABLE:
                            printf("Got FILE_UPDATE_AVAILABLE\n");
                            downloading = 1;
                            xi_parse_file_update_available(cb);
                            cn_cbor_free(cb CBOR_CONTEXT_PARAM);
                            printf("retrieved update available, publishing encoded data\n");
                            xi_publish_data( in_context_handle, xi_stopic, encoded, enc_sz, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
                            printf("logging file update available\n");
                            // Log the FILE_UPDATE_AVAILABLE information
							snprintf(message,sizeof(message),"FILE_UPDATE_AVAILABLE");
							bufptr = filefingerprintASCII;
							for(i=0;i<32;i++) {
								bufptr += sprintf(bufptr,"%02x",filefingerprint[i]);
							}
							*bufptr = '\0';
							snprintf(message,sizeof(message),"File update available");
							snprintf(details,sizeof(details),"name=%s revision=%s length = %d fingerprint = %s"
									,filename,fileRevision,filelength,filefingerprintASCII);
							snprintf(buffer,sizeof(buffer),"{\"message\":\"%s\",\"severity\":\"notice\",\"details\":\"%s\"}",message,details);
							xi_publish( in_context_handle, xi_logtopic, buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
							sha256_init(&ctx);
							offset = 0;
							retVal =  sl_extlib_FlcOpenFile("/sys/mcuimgA.bin", filelength, &ulToken, &lFileHandle, FS_MODE_OPEN_WRITE);
							printf("mcuimgA.bin open returned %d\n",retVal);
							if(retVal < 0) downloading = 0;
							break;
					case XI_FILE_CHUNK:
							xi_parse_file_chunk(cb);
							//printf("   CALLBACK HANDLER parsing complete.  downloading: %d\n", downloading);
							cn_cbor_free(cb CBOR_CONTEXT_PARAM);
							if(1 == downloading)
							{
								if(offset < filelength)
								{
								    printf(" CALLBACK HANDLER Publishing for next chunk request\n");
									xi_publish_data( in_context_handle, xi_stopic, encoded, enc_sz, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
								}
							}
							else
							{
                                downloading = 0;
                                sprintf(installedfilerevision, "%s",fileRevision);
                                printf("Done downloading. Offset = %d\n",offset);
                                // Log the download complete information
                                snprintf(message,sizeof(message),"File download complete");
                                snprintf(details,sizeof(details),"name=%s revision=%s length = %d",filename,installedfilerevision,filelength);
                                snprintf(buffer,sizeof(buffer),"{\"message\":\"%s\",\"severity\":\"notice\",\"details\":\"%s\"}",message,details);
                                xi_publish( in_context_handle, xi_logtopic, buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
                                sha256_final(&ctx,hash);
                                printf("Calculated hash = 0x");
                                print_hash(hash);
                                offset = 0;
                                xi_publish_file_info(in_context_handle);
                                int result = 0;
                                result = sl_extlib_FlcCloseFile(lFileHandle, NULL, NULL, 0);
                                printf("*** Close File Result: %d\n", result);
                                result = sl_extlib_FlcTest(FLC_TEST_RESET_MCU | FLC_TEST_RESET_MCU_WITH_APP);
                                printf("*** FLC Test Result: %d, rebooting\n", result);
                                RebootMCU();
                            }
                            break;
                        default:
                            break;
                    }
                }

