xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
typedef struct xi_sft_file_chunk_s
{
    uint offset;
    uint chunk_length;
    uint array_length;
    uint status;
    unsigned char* byte_array;
} xi_sft_file_chunk_t;

int xi_parse_file_chunk_temp(cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk )
{
    if( NULL == in_cb || NULL == out_sft_file_chunk )
    {
        return -1;
    }

    cn_cbor *cb_item = NULL;
    memset( out_sft_file_chunk, 0, sizeof(xi_sft_file_chunk_t) );

    //
    // msg version
    //
    cb_item = cn_cbor_mapget_string( in_cb, "msgver" );
    if(cb_item)
    {
        if( 1 != cb_item->v.uint )
        {
            printf( "FILE_CHUNK unsupported message version: %d\n", cb_item->v.uint );
            return -1;
        }
    }
    else
    {
       printf( "FILE_CHUNK message missing message version field\n" );
       return -1;
    }

    //
    // chunk offset
    //
    cb_item = cn_cbor_mapget_string( in_cb, "O" );
    if( cb_item )
    {
       out_sft_file_chunk->offset = cb_item->v.uint;
    }
    else
    {
        printf("FILE_CHUNK message missing offset field\n");
        return -1;
    }

    //
    // chunk length
    //
    cb_item = cn_cbor_mapget_string( in_cb, "L" );
    if( cb_item )
    {
        out_sft_file_chunk->chunk_length = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing length field\n" );
        return -1;
    }

    //
    // Status
    //
    cb_item = cn_cbor_mapget_string( in_cb, "S" );
    if( cb_item )
    {
        out_sft_file_chunk->status = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing status field\n" );
        return -1;
    }

    //
    // Byte Array
    //
    cb_item = cn_cbor_mapget_string( in_cb, "C" );
    if(cb_item)
    {
        out_sft_file_chunk->array_length = cb_item->length;
        out_sft_file_chunk->byte_array = (unsigned char *)cb_item->v.str;
    }
    else
    {
        printf( "FILE_CHUNK message missing byte array field\n" );
    }

    return 0;
}

int total_messages = 0;

void xi_parse_file_chunk( cn_cbor *cb )
{
    cn_cbor *cb_item;
    unsigned chunkoffset = 0;
    int retval;

    cb_item = cn_cbor_mapget_string(cb, "msgver");
    if(cb_item) {
        // printf("FILE_CHUNK: msgver = %d\n",cb_item->v.uint);
    }

    cb_item = cn_cbor_mapget_string(cb, "O");
       if(cb_item) {
           printf("FILE_CHUNK: offset = %d\n",cb_item->v.uint);
       } else {
           printf("No key called O\n");
       }


    cb_item = cn_cbor_mapget_string(cb, "L");
    if(cb_item)
    {
        printf("---- FILE_CHUNK: length = %d FILE_LENGTH: %d\n",cb_item->v.uint, filelength);
        // Save the offset for THIS fine chunk
    	    chunkoffset = offset;

    	    // Build the offset for the NEXT file chunk
        offset += cb_item->v.uint;

        if(currenttenpercent < offset)
        {
            /* Yes, I know this is terrible, but it's the level of effort appropriate to the task. */
        	    printf("Downloaded %d bytes %d %%  of the file \n",offset, (100 * (currenttenpercent + 1000)) / filelength);
        	    currenttenpercent += tenpercent;
        }
    }
    else
    {
        printf("No key called L\n");
    }

    cb_item = cn_cbor_mapget_string(cb, "C");
    if(cb_item)
    {
            printf("cb_item->length = %d\r\n",cb_item->length);
            if(cb_item->length > 0)
            {
                int writelength = cb_item->length;
                if( chunkoffset + cb_item->length > filelength )
                {
                    writelength = filelength - chunkoffset ;
                    downloading = 0;
                }
                sha256_update(&ctx,(unsigned char *)cb_item->v.str,cb_item->length);
                retval = sl_extlib_FlcWriteFile(lFileHandle, chunkoffset, (unsigned char *)cb_item->v.str, writelength);
                if( retval < cb_item->length )
                {
                    downloading = 0;
                    //sl_extlib_FlcCloseFile(lFileHandle, NULL, NULL, 0);
                }
                printf("Write returned %d\n",retval);

                if( (chunkoffset + cb_item->length) >= filelength )
                {
                    printf("Downloaded is done\n");
                    downloading = 0;
                }
            }
            else
            {
                downloading = 0;
                //sl_extlib_FlcCloseFile(lFileHandle, NULL, NULL, 0);
            }
    }
    else
    {
        printf("No key called C\n");
    }

    cb_item = cn_cbor_mapget_string(cb, "S");
    if(cb_item) {
        // printf("FILE_CHUNK: status = %d\n",cb_item->v.uint);

        if(cb_item->v.uint > 1) {
        	downloading = 0;
        	sl_extlib_FlcCloseFile(lFileHandle, NULL, NULL, 0);
        }
    } else {
        printf("No key called S\n");
    }

#if 1
    printf("File chunk request params:\n");
    int messageType = XI_FILE_GET_CHUNK;
    int messageVersion = 1;
    int messageLength = 1024;
    printf("msgtype: %d\n", messageType);
    printf("msgver: %d\n", messageVersion);
    printf("N: \"%s\"\n", incomingFilename);
    printf("R: \"%s\"\n", fileRevision);
    printf("O: %d\n", offset);
    printf("L: %d\n", messageLength);

    printf("internal downloading: %d\n", downloading);
    if(1 == downloading) {
		/* Let's try making a GET_CHUNK packet */
        printf("creating get_chunk packet\n");
		cn_cbor_errback err;
		cn_cbor *cb_map = cn_cbor_map_create(&err);

		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("msgtype", &err),
						cn_cbor_int_create(messageType, &err), &err);

		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("msgver", &err),
						cn_cbor_int_create(messageVersion, &err), &err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("N", &err),
						cn_cbor_string_create(incomingFilename, &err),
						&err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("R", &err),
						cn_cbor_string_create(fileRevision, &err),
						&err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("O", &err),
						cn_cbor_int_create(offset, &err), &err);
		cn_cbor_map_put(cb_map,
						cn_cbor_string_create("L", &err),
						cn_cbor_int_create(messageLength, &err), &err);

